/* IDIOMA RUSO */

const ru = {

    /* НАВИГАЦИОННАЯ ПАНЕЛЬ */
    navbarTitle: "AdriDevSP",

    /* ВВЕДЕНИЕ */
    introText: "Привет, мир! Меня зовут",
    jobTitle: "Я <span class='highlight'>Fullstack-разработчик!</span>",
    motto: "Fullstack и мобильный разработчик днём, аналитик по кибербезопасности ночью.",

    /* ОКНО КОНТАКТОВ */
    contactBtn: "&lt; Контакты /&gt;",
    popupTitle: "Электронные адреса",

    /* ОКНО СКАЧИВАНИЯ РЕЗЮМЕ */
    downloadBtn: "Скачать резюме",
    cvpopupheader: "Выберите тип резюме",
    cvfullstackbtn: "Резюме Fullstack / Mobile",
    cvcyberbtn: "Резюме по кибербезопасности",

    /* ПРОЕКТЫ */
    projectsTitle: "Проекты",
    projectbtngreen: "Посмотреть проект",
    projectbtndark: "Посмотреть код",

    miportfolioname: "Моё портфолио",
    miportfoliodesc: "Адаптивное персональное портфолио, созданное с использованием HTML, CSS и JavaScript. Включает плавные анимации, раздел проектов и развертывание через GitHub.",

    //Проект: NetCalc
    netcalcname: "NetCalc",
    netcalcprojectbtngreen: "Читать далее",
    netcalcdesc: "Веб- и консольное приложение для расчета параметров IP-сетей (сетевой адрес, широковещательный адрес, доступные хосты и т.д.). Позволяет экспортировать результаты в JSON и предназначено для студентов и специалистов по сетям.",


    /* ТЕХНОЛОГИЧЕСКИЕ НАВЫКИ */
    techSkillsTitle: "Технологические навыки",
    techSkillsDescription: "Во время моего обучения как Fullstack-разработчика я приобрёл навыки в разработке программного обеспечения и опыт работы с основными инструментами, которые позволяют создавать масштабируемые и надёжные мобильные и кроссплатформенные приложения. Ниже представлены технологические навыки, которые помогли мне достичь текущего уровня:",
    frontend: "Фронтенд",
    backend: "Бэкенд",
    programmingLanguages: "Языки программирования",
    databases: "Базы данных",
    versionControl: "Системы контроля версий",
    frameworks: "Фреймворки",
    ide: "IDE",
    otherTechnologies: "Другие технологии",

    /* ОПЫТ РАБОТЫ */
    experienceTitle: "Опыт работы",
    noExperience: "Пока у меня нет опыта работы, но я продолжаю разрабатывать личные проекты :D",

    /* НАВЫКИ ПО ЖЕЛЕЗУ */
    hardwareSkillsTitle: "Навыки по железу",
    hardwareSkillsDescription: "Помимо разработки ПО и кибербезопасности, у меня есть знания в области аппаратного обеспечения, сборки ПК и многое другое.",
    hardwareMaintenance: "Обслуживание и диагностика",
    hardwareRepair: "Ремонт оборудования",
    virtualization: "Установка и управление виртуальными средами на физических устройствах",
    serverMaintenance: "Обслуживание и диагностика серверов",
    embeddedDevices: "Встроенные устройства",

    hardwareSpans: { 
        maintenance: [
            "Сборка настольных ПК",
            "Установка и настройка различных операционных систем",
            "Обнаружение неисправностей оборудования"
        ],
        repair: [
            "Базовый ремонт ноутбуков (Windows или Linux)",
            "Базовый ремонт мобильных устройств (Android)",
            "Базовый ремонт планшетов",
            "Средний уровень ремонта настольных ПК",
            "Базовая оптимизация производительности"
        ],
        virtualization: [
            "Установка виртуальных сред (VMware и VirtualBox)",
            "Создание и управление виртуальными машинами",
            "Настройка виртуального оборудования (CPU, RAM, хранилище)"
        ],
        serverMaintenance: [
            "Установка серверных ОС (Windows Server, Ubuntu Server и др.)",
            "Базовая сборка и установка физических серверов",
            "Базовая оптимизация серверного оборудования"
        ],
        embeddedDevices: "Arduino"
    },

    /* ОБО МНЕ */
    aboutMeTitle: "Обо мне",
    aboutMeIntro1: "Привет! Я <strong>Андриан Сабино</strong>, увлечённый <strong>Fullstack и мобильный разработчик</strong>, сосредоточенный на создании современных и функциональных приложений. Сейчас я также обучаюсь, чтобы стать <strong>младшим аналитиком по кибербезопасности</strong>.",
    aboutMeIntro2: "Моя карьера сочетает творческий подход разработки ПО с точностью анализа киберугроз. Мне нравится преодолевать вызовы, учиться и исследовать новые технологии для улучшения своих навыков.",

    ambitionsTitle: "🎯 Жизненные цели",
    ambitionsList: [
        "🛡️ Стать <strong>экспертом по кибербезопасности</strong>.",
        "🔒 Работать в ведущих международных компаниях в области кибербезопасности (Telefónica, Google, Deloitte, Microsoft, IBM, Cisco, Oracle и др.).",
        "🖱️ Максимально развить навыки Fullstack и кроссплатформенной разработки.",
        "🏡 Посетить и пожить в разных странах, чтобы узнать культуры и мир вокруг.",
        "🎯 Прожить максимум опыта, чтобы расти как личность.",
        "👥 Создать широкую сеть контактов и друзей разных культур, как местных, так и международных.",
    ],

    hobbiesTitle: "🎨 За пределами кода",
    hobbiesIntro: "Когда я не программирую, не изучаю кибербезопасность и новые технологии, я люблю:",
    hobbiesList: [
        "🎮 Играть в видеоигры (любимые жанры: стратегия, шутеры, хорроры, выживание, исторические и Souls-игры).",
        "♟️ Играть в настольные игры (например, шахматы, Risk, Seven Wonders Duels, Carcassonne).",
        "📖 Изучать мировую историю, особенно историю Испании, и анализировать геополитику.",
        "📺 Смотреть фильмы, сериалы и аниме.",
        "🎵 Слушать музыку (Estopa, Fito y Fitipaldis, Mägo de Oz, El canto del loco, Dani Martín и Melendi)."
    ],

    curiositiesTitle: "🤔 Интересные факты обо мне",
    curiositiesList: [
        "👨‍💻 Я написал свою первую программу на Python в 16 лет.",
        "📌 Я испанец из Кадиса (Андалусия).",
        "🏅 Побеждал в шахматных турнирах в Кампо-де-Гибралтар.",
        "🌐 Увлекаюсь историей и геополитикой и их влиянием на технологии.",
        "🧠 Обожаю всё, что связано со стратегией — отличный способ развивать ум.",
        "🥊 Интересуюсь контактными видами спорта (бокс, кикбоксинг, джиу-джитсу), хотя пока не практиковал.",
        "⚽ Люблю командные и индивидуальные виды спорта (футбол, теннис, падел и т.д.).",
        "🎶 Люблю петь и мечтаю создать музыкальную группу в будущем."
    ],

    faqTitle: "❔ Часто задаваемые вопросы",
    faq: [
        {
            question: "Какой твой любимый язык программирования?",
            answer: "В данный момент мне очень нравится использовать Dart с Flutter для создания кроссплатформенных приложений."
        },
        {
            question: "В какой соцсети ты наиболее активен?",
            answer: "Я использую многие соцсети, но чаще всего бываю в Instagram."
        },
        {
            question: "Есть ли у тебя водительские права?",
            answer: "Да, у меня есть права категории B. Я сдал теоретический экзамен с нулём ошибок и практический с одной небольшой ошибкой."
        },
        {
            question: "Какой у тебя уровень английского?",
            answer: "Считаю, что у меня средний уровень английского (B1), но пока нет официального сертификата."
        },
        {
            question: "Android или iOS?",
            answer: "Я всегда пользовался Android и считаю его лучше iOS из-за большей свободы. Разрабатываю как для Android, так и для iOS."
        },
        {
            question: "Windows, Mac или Linux?",
            answer: "Предпочитаю Windows за удобство, но также использую Linux (например, Kali) в профессиональных целях. Mac не использую, так как предпочитаю открытые системы."
        },
        {
            question: "Как с тобой связаться?",
            answer: "Ты можешь связаться со мной через соцсети или по email. Я всегда открыт для новых возможностей и сотрудничества!"
        }
    ],

    /* ИЗБРАННЫЕ МЕСТА */
    preferredtitle: "Любимые места",
    preferreddescription: "Список стран, городов или регионов, где я хотел бы жить, работать или учиться. Упорядочено от самых предпочтительных сверху вниз и слева направо. По личным причинам я не готов переезжать или работать в странах, не указанных в этом списке.",
    flagpopuptitle: "Избранные города",
    showmoreBtn: "Показать больше",
    showLessBtn: "Показать меньше",
    tooltip: "Дополнительная информация",

    /* МЯГКИЕ НАВЫКИ */
    softSkillsTitle: "Мягкие навыки",
    softSkillsDescription: "Я развил межличностные, методические и внутренние навыки, дополняющие мои технические знания.",

    interpersonalSkills: "Межличностные навыки",
    interpersonalList: [
        "Командная работа",
        "Активное слушание"
    ],

    methodicalSkills: "Методические навыки",
    methodicalList: [
        "Организация",
        "Решение проблем",
        "Внимание к деталям"
    ],

    intrapersonalSkills: "Внутренние компетенции",
    intrapersonalList: [
        "Адаптивность",
        "Самодисциплина",
        "Инициативность",
        "Постоянное обучение"
    ],

    /* ОБРАЗОВАНИЕ */
    educationTitle: "Моё образование",
    formalStudies: "📚 Формальное образование",

    highSchoolTitle: "Старшая школа по естественным наукам",
    highSchoolCenter: "<b>Школа:</b> IES El Getares (Альхесирас)",
    highSchoolDate: "<b>Период:</b> Сентябрь 2020 - Июнь 2022",
    highSchoolDescription: "<b>Описание:</b> Получил хорошую базу в биологии, химии и математике, развил аналитические навыки и способность решать задачи. Здесь я впервые открыл для себя программирование и решил выбрать эту сферу для карьеры.",
    skillsAcquiredText: "Полученные навыки:",
    highSchoolSkills: [
        "Адаптивность",
        "Решение проблем",
        "Английский (B1)",
        "Французский (A2)"
    ],
    highSchoolIcons: [
        { src: "resources/Software_Icons/Python.png", alt: "Python", title: "Python" }
    ],

    damTitle: "FPGS по разработке кроссплатформенных приложений (DAM)",
    damCenter: "<b>Центр:</b> IES Rafael Alberti (Кадис)",
    damDate: "<b>Период:</b> Сентябрь 2022 - Июнь 2024",
    damDescription: "<b>Описание:</b> Специализированное обучение проектированию, разработке и поддержке кроссплатформенных приложений. Я изучил несколько языков программирования и фреймворков, особенно выделяясь в мобильной разработке на Kotlin и Flutter.",
    damIcons: [
        { src: "resources/Software_Icons/Kotlin.png", alt: "Kotlin", title: "Kotlin" },
        { src: "resources/Software_Icons/JetpackCompose.png", alt: "JetpackCompose", title: "JetpackCompose" },
        { src: "resources/Software_Icons/Dart.png", alt: "Dart", title: "Dart" },
        { src: "resources/Software_Icons/Flutter.png", alt: "Flutter", title: "Flutter" },
        { src: "resources/Software_Icons/CShard.png", alt: "C#", title: "C#" },
        { src: "resources/Software_Icons/MySQL.png", alt: "MySQL", title: "MySQL" },
        { src: "resources/Software_Icons/MongoDB.png", alt: "MongoDB", title: "MongoDB" },
        { src: "resources/Software_Icons/Firebase.png", alt: "Firebase", title: "Firebase" }
    ],

    certifications: "📜 Сертификации",
    cybersecTitle: "Введение в кибербезопасность",
    cybersecCenter: "<b>Центр:</b> Cisco Networking Academy",
    cybersecDate: "<b>Дата:</b> Январь 2025",
    cybersecDescription: "<b>Описание:</b> Основы кибербезопасности, включая распространённые угрозы, защиту систем и значение цифровой безопасности.",
    cybersecSkills: [
        "Обнаружение угроз"
    ],

    networkingbasicsTitle: "Основы сетей",
    networkingbasicsCenter: "<b>Центр:</b> Cisco Networking Academy",
    networkingbasicsDate: "<b>Дата:</b> Апрель 2025",
    networkingbasicsDescription: "<b>Описание:</b> Основы сетей, включая OSI, TCP/IP, IP-адресацию, работу маршрутизаторов и коммутаторов, а также принципы сетевой безопасности и устранения неполадок.",
    networkingbasicsSkills: [
        "Основы сетей и соединений",
        "Модель OSI и TCP/IP",
        "IP-адресация и подсети",
        "Работа коммутаторов и маршрутизаторов",
        "Обнаружение и устранение проблем",
        "Основы сетевой безопасности"
    ],

    awards: "🏆 Награды",
    noAwards: "У меня пока нет наград, но я активно работаю над этим! 📱",

    contributions: "🤝 Вклад",
    noContributions: "Пока не сделал вкладов, но планирую внести свой вклад в сообщество в будущем! 💻",

    events: "📅 Участие в событиях",
    noEvents: "Я ещё не участвовал в мероприятиях, но с радостью сделаю это в будущем! 🎤",

};

export default ru;
